{
  "sessions": [
    {
      "id": "workshop-registration",
      "title": "Registration & Breakfast",
      "type": "break",
      "dayId": "workshop-day",
      "timeSlotId": "ws-slot1",
      "description": "Registration and welcome breakfast for workshop participants.",
      "isFullWidth": true
    },
    {
      "id": "workshop-morning-1",
      "title": "Scalable Kubernetes with Hosted Control Planes and Immutable Nodes",
      "type": "workshop",
      "dayId": "workshop-day",
      "timeSlotId": "ws-slot2",
      "trackId": "track1",
      "roomId": "room1",
      "description": "In this workshop, you'll learn how to deploy Kubernetes clusters using the Hosted Control Plane (HCP) architecture combined with immutable worker nodes, a powerful approach that enhances scalability, reduces control plane resource usage, and strengthens your platform's security posture.\n\nWe'll explore how to achieve this architecture using two CNCF projects:\n\n- Kamaji, to manage lightweight, multi-tenant hosted control planes.\n\n- Kairos, to build and manage secure, immutable nodes that are GitOps-ready by design.\n\nThrough hands-on work, you'll learn how to generate Kairos artifacts using a web-based UI, configure them to automatically join tenant clusters managed by Kamaji, and lay the foundation for scalable, reproducible Kubernetes infrastructure — from core to edge.",
      "speakerIds": ["mauro-morales","ettore-di-giacinto","dimitris-karakasilis"],
      "tags": ["ENG"],
      "level": "Beginners"
    },
    {
      "id": "workshop-morning-2",
      "title": "PostgreSQL su Kubernetes con CloudNativePG",
      "type": "workshop",
      "dayId": "workshop-day",
      "timeSlotId": "ws-slot2",
      "trackId": "track2",
      "roomId": "room2",
      "description": "In questo workshop pratico di 4 ore, i partecipanti impareranno a fare il deploy di un cluster PostgreSQL e a gestirlo in Kubernetes utilizzando CloudNativePG, l’operatore open source nella Sandbox della CNCF. Il corso guiderà passo dopo passo dalla creazione del primo cluster CNPG fino alla configurazione di backup continui e all’implementazione dell’alta disponibilità su più cluster Kubernetes.\n\nI partecipanti impareranno l'utilizzo del plugin di Kubectl per CNPG che semplifica la gestione del cluster, dalla lettura aggregata dei log del cluster, all'esecuzione di comandi imperativi. Durante il corso configureranno il backup utilizzando il plugin di Barman Cloud, per l’archiviazione su object storage, e impareranno a ripristinare un cluster attraverso la Point In Time Recovery. Bonus: monitoraggio.\n\nIl worksho è rivolto a DevOps, SRE e sviluppatori che desiderano gestire PostgreSQL su tutte le distribuzioni Kubernete supportate.\n\nRequisiti: ogni partecipante dovrà seguire la guida all'installazione sul proprio laptop dei requisiti nel README del progetto cnpg-playground: https://github.com/cloudnative-pg/cnpg-playground/?tab=readme-ov-file#prerequisites",
      "speakerIds": ["jonathan-battiato", "jonathan-gonzalez-v"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "workshop-lunch",
      "title": "Lunch",
      "type": "break",
      "dayId": "workshop-day",
      "timeSlotId": "ws-slot3",
      "description": "Lunch break for workshop participants.",
      "isFullWidth": true
    },
    {
      "id": "workshop-afternoon-1",
      "title": "Orchestrating Add-ons and Applications Across Multi-Cluster Kubernetes Environments with Sveltos",
      "type": "workshop",
      "dayId": "workshop-day",
      "timeSlotId": "ws-slot4",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Managing Kubernetes add-ons and applications across multiple clusters is complex and error-prone. As environments scale, ensuring consistency, automating deployments, and handling cluster-specific configurations becomes increasingly difficult. \n\nSveltos is a lightweight, Kubernetes-native solution that simplifies the management of add-ons and applications across any number of clusters. It lets you define desired configurations declaratively and automatically applies them to target clusters based on labels selectors. With Sveltos, platform teams can ensure consistent, policy-driven deployments while reducing manual effort and minimizing drift across environments.",
      "speakerIds": ["gianluca-mardente"],
      "tags": ["ENG"],
      "level": "Intermediate"
    },
    {
      "id": "workshop-afternoon-2",
      "title": "Dagli Alert all’Azione: costruire una Cloud-Native Security efficace con Falco, Feeds & Talon",
      "type": "workshop",
      "dayId": "workshop-day",
      "timeSlotId": "ws-slot4",
      "trackId": "track2",
      "roomId": "room2",
      "description": "In questo workshop pratico esploreremo l’intero ecosistema Falco — dall’installazione via Helm all’orchestrazione della incident response con Talon — per dimostrare come creare una sicurezza cloud-native robusta usando soltanto strumenti open-source.\n\nAgenda:\n\n1) Introduzione e setup – installazione di Falco e degli altri componenti.\n\n2) Atomic Red Team in azione – tre simulazioni guidate (File Deletion, Container Escape, Boot/Logon Persistence) per osservare gli alert in tempo reale.\n\n3) Falco Feeds by Sysdig – gestione delle regole con falcoctl, aggiornamenti quotidiani e riduzione dei falsi positivi.\n\n4) Falco Talon – configurazione del motore di risposta automatizzata per reagire immediatamente agli eventi rilevati.\n\nUn laboratorio interamente hands-on, pensato per SRE, DevOps e Security Engineer che vogliono integrare la sicurezza nel cuore dei propri flussi cloud-native: dalla prima regola alla prima remediation automatica.",
      "speakerIds": ["giulio-puri", "andrea-vivaldi"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "workshop-networking",
      "title": "Networking",
      "type": "break",
      "dayId": "workshop-day",
      "timeSlotId": "ws-slot5",
      "description": "Networking and informal discussions among workshop participants.",
      "isFullWidth": true
    },
    {
      "id": "conference-registration",
      "title": "Registration & Networking",
      "type": "break",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot1",
      "description": "Welcome to Cloud Native Days Italy 2025! Join us for registration, coffee, and networking with fellow attendees.",
      "isFullWidth": true
    },
    {
      "id": "opening-keynote",
      "title": "🗝️ Opening Keynote: The New Digital Nervous System",
      "type": "keynote",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot2",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Synapses and the nervous system form the intricate network enabling the human body to sense, process, and respond to information, as the cloud computing serves as the digital nervous system of the modern era. In the human body, synapses transmit signals between neurons, allowing for rapid communication and complex decision-making that keeps the organism agile and responsive... Does it sound familiar? Let's talk about how human body, software architecture and community make us connected, as humans, and as professionals.",
      "speakerIds": ["serena-sensini"],
      "isFullWidth": true,
      "tags": ["ENG"],
      "level": "all"
    },
    {
      "id": "session-1-track1",
      "title": "Bridging the Gaps: Communication Strategies for Kubernetes Releases",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot3",
      "trackId": "track1",
      "roomId": "room1",
      "description": "In this talk, I’ll explore how the Kubernetes Communications Team serves as the vital link between the technical contributors driving Kubernetes innovation and the global community relying on it. \n\nYou’ll learn how we:\n\n- Coordinate across SIGs (Special Interest Groups) to capture and clarify key updates, to review changes and ensure the quality of the information provided is the highest possible.\n\n- Translate technical release notes and KEPs into actionable insights for end users in the form of release blogs.\n\n- Leverage tools and strategies to keep communication seamless, even in one of the most fast-paced open source projects in the world.\n\nWhether you’re planning to contribute to Kubernetes, navigating its releases or maintaining any open source project, this session will provide insights into how open source communication practices can amplify collaboration, transparency, and serve your users. \n\nJoin me to understand how communication drives the Kubernetes evolution!",
      "speakerIds": ["matteo-bianchi"],
      "tags": ["ITA"],
      "level": "all"
    },
    {
      "id": "session-1-track2",
      "title": "Bringing Cloud-Native Agility to Bare-Metal Kubernetes with Cluster API and Metal³",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot3",
      "trackId": "track2",
      "roomId": "room2",
      "description": "When we think of Cloud Native, we often think of public cloud—but on-premises infrastructure remains an important part of the equation in many instances. Running Kubernetes on-prem often adds complexity, but deploying clusters directly on bare metal—without hypervisors or private cloud layers—introduces an additional layer of operational challenges.\n\nIn this session, we'll dive deep into how Cluster API (CAPI) and Metal³ transform bare-metal Kubernetes deployments by bringing software-defined infrastructure principles to physical hardware. We'll cover:\n\n- Automated provisioning of bare-metal nodes using Kubernetes-native APIs\n\n- Cluster API's declarative approach to scaling Kubernetes across physical servers\n\n- Metal³'s integration with Ironic to enable hardware lifecycle management\n\n- Real-world use cases and the challenges of bare-metal operations at scale\n\nIf you are looking to modernize on-prem Kubernetes while maintaining full control over your hardware, join us to explore how these open-source tools are bringing cloud-like automation to bare metal.",
      "speakerIds": ["xavier-avrillier"],
      "tags": ["ENG"],
      "level": "Intermediate"
    },
    {
      "id": "session-2-track1",
      "title": "Centralizzare i Log in ambienti Multi-cluster con Loki: Architettura e Casi d'Uso",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot4",
      "trackId": "track1",
      "roomId": "room1",
      "description": "In ambienti Kubernetes multi-cluster, correlare eventi e risolvere problemi è complesso: i servizi distribuiti generano enormi volumi di log frammentati tra cluster diversi, mettendo in difficoltà le soluzioni di logging tradizionali sia per prestazioni che per storage.\n\nQuesto talk dimostra come Grafana Loki, una soluzione open source progettata per garantire il pieno controllo sui propri dati, permetta di costruire un sistema di logging centralizzato. Presenterò un caso reale di implementazione in una cluster mesh, evidenziando come la sua architettura basata su etichette e storage distribuito consenta di gestire efficacemente i log.\n\nDurante la sessione verranno mostrate le tecniche di implementazione di Loki in ambiente multi-cluster, i pattern per correlare efficacemente i log tra servizi distribuiti e le strategie di ottimizzazione per gestire grandi volumi di dati, il tutto con un approccio cloud native.",
      "speakerIds": ["marco-ferraioli"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "session-2-track2",
      "title": "Less is More (Even in Kubernetes): A Practical Guide to Sustainable Infra",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot4",
      "trackId": "track2",
      "roomId": "room2",
      "description": "It started with a simple question from my kid: “Why does your job need so many computers?” Oof. Turns out… she was right to ask. In this talk, we’ll unpack the sneaky ways Kubernetes clusters waste resources—and what we can do about it. You’ll walk away with a “sustainable K8s toolbox,” a better answer for your own curious kids and friends, and a solid case for why “less is more” isn’t just good engineering—it’s good ethics.",
      "speakerIds": ["flavia-paganelli"],
      "tags": ["ENG"],
      "level": "all"
    },
    {
      "id": "coffee-break-1",
      "title": "☕ Coffee Break",
      "type": "break",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot5",
      "description": "Refresh with coffee and snacks while networking with other attendees.",
      "isFullWidth": true
    },
    {
      "id": "session-3-track1",
      "title": "MLOps con GitHub Actions: training, testing e deploy di un modello di Machine Learning",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot6",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Automatizzare i processi di Machine Learning è essenziale per accelerare lo sviluppo e il rilascio di modelli affidabili ed efficienti. In questa talk cercheremo di capire come utilizzare GitHub Actions per creare pipeline che gestiscano l'intero ciclo di vita di un modello di Machine Learning, dalla fase di training fino al deployment in produzione.\n\nQuesta sessione vuole essere molto pratica: utilizzeremo GitHub Actions per migliorare la riproducibilità, la collaborazione tra team e la scalabilità dei progetti di Machine Learning. Che tu sia uno sviluppatore, un DevOps engineer o un data scientist, spero che questa talk ti aiuterà a creare i tuoi workflows.",
      "speakerIds": ["claudio-masolo"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "session-3-track2",
      "title": "Observability is Shifting Left: Are You Ready?",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot6",
      "trackId": "track2",
      "roomId": "room2",
      "description": "Traditionally, observability has lived in the world of DevOps—focused on monitoring production systems and detecting failures after the fact. But in modern, distributed architectures, that’s too little, too late. As systems grow in complexity, teams are realizing that observability needs to shift left—integrated earlier in the development cycle to support debugging, testing, and faster feedback loops.\n\nIn this talk we’ll cover the common challenges teams face when trying to implement observability during development and how developers, QA, and platform engineers can all benefit from implementing it before code reaches production. \n\nBy the end of this session, you’ll walk away with a clear roadmap to make observability a first-class part of your development workflow—accelerating issue resolution, improving collaboration across teams, and delivering more reliable software faster.",
      "speakerIds": ["vladi-stevanovic"],
      "tags": ["ENG"],
      "level": "all"
    },
    {
      "id": "session-4-track1",
      "title": "Kubernetes Like Lego: Building the New Standard for European Cloud APIs",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-sponsored-slot1",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Nel panorama tecnologico attuale, Kubernetes si è affermato come uno strumento fondamentale per l'orchestrazione di container, trasformandosi in una piattaforma di riferimento per l'innovazione cloud. In questo intervento, esploreremo come l'approccio basato su Kubernetes sia stato impiegato nella progettazione e realizzazione delle API cloud avanzate SECA potenziando l’infrastruttura digitale per il futuro\nPresenteremo casi d'uso pratici che dimostrano i benefici di questa architettura, sottolineando l'importanza della comunità open source nell'evoluzione del progetto. Unitevi a noi per questa esplorazione di come Kubernetes non sia solo un'implementazione tecnica, ma l’approccio su cui costruire il prossimo livello di innovazione cloud.",
      "speakerIds": ["luca-spagnoli", "amedeo-palopoli"],
      "tags": ["SPONSORED"],
      "level": "Intermediate"
    },
    {
      "id": "session-4-track2",
      "title": "Ottimizzazione dei Costi con IAAC: Come Automazione e Cloud Nativo Possono Fare la Differenza",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-sponsored-slot1",
      "trackId": "track2",
      "roomId": "room2",
      "description": "Esploreremo come l'approccio Infrastructure as Code (IaC) possa ottimizzare i costi nel cloud automatizzando la creazione e la distruzione dinamica delle risorse con AWS Lambda e CloudFormation. Inoltre, capiremo come ridurre significativamente le spese operative e, allo stesso tempo, migliorare l'efficienza senza compromettere né performance né sicurezza grazie a soluzioni serverless e gestione delle risorse su richiesta.",
      "speakerIds": ["tommaso-dri"],
      "tags": ["SPONSORED"],
      "level": "Intermediate"
    },
    {
      "id": "session-5-track1",
      "title": "GitOps at Scale: A Real-World Journey Managing a Fleet of Clusters with ArgoCD",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot8",
      "trackId": "track1",
      "roomId": "room1",
      "description": "In questa sessione ripercorriamo il percorso evolutivo dell’adozione del modello GitOps su larga scala in Zucchetti, in un contesto enterprise su cloud privato, per standardizzare la Continuous Delivery su una flotta eterogenea di cluster.\n\nUna volta superata l'adozione iniziale del paradigma GitOps, abbiamo definito un’architettura per ArgoCD scalabile e riutilizzabile basata su pattern come App of Apps, Apps in any Namespace, hub-and-spoke e uso avanzato degli AppProject per abilitare la multi-tenancy.\n\nIllustreremo le soluzioni adottate per affrontare temi come la gestione dell'RBAC, la propagazione delle configurazioni infrastrutturali e applicative, bilanciamento del carico e ottimizzazione del consumo risorse.\n\nCondivideremo inoltre l’integrazione di pratiche FinOps per tracciare i costi, attribuirli ai team e garantire sostenibilità.\n\nConcluderemo con uno sguardo al futuro introducendo un nuovo approccio multicluster pull-based come alternativa all'attuale approccio push-based.",
      "speakerIds": ["massimo-groppelli", "luca-carini"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "session-5-track2",
      "title": "Pok8s: The Art of Curated Kubernetes OS Images",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot8",
      "trackId": "track2",
      "roomId": "room2",
      "description": "In the age of containers and abstraction, we’re told the operating system no longer matters. That you can run anything on anything. But the reality is more nuanced — your organization might have deep expertise in a specific distro, licensing constraints, or compliance requirements that shape your stack from the kernel up. And the same applies to your Kubernetes flavor of choice.\n\nBut setting up your Kubernetes infrastructure shouldn’t feel like you’re out at sea — catching the fish, cleaning it, and prepping every ingredient from scratch. Instead, it should feel like walking into your favorite poke spot: the freshest options already hand-picked for you, curated with care, and ready for you to assemble exactly the way you like it. That’s the experience Kairos Factory brings to infrastructure — letting you focus on what matters, while still getting a stack tailored to your exact taste.\n\nIn this talk, we introduce Kairos Factory, a web-based builder that lets you assemble secure, immutable Kubernetes-ready OS images tailored to your needs. Think of it as Pok8s — your build-your-own Kubernetes Poke Bowl. Choose your base OS (Ubuntu, Alpine, etc.), pick your Kubernetes distribution (k3s, k0s), toss in your configuration toppings (VPNs, CRDs, mesh configs), and layer on your favorite sauces — TPM-backed boot, full-disk encryption, and other security features.\n\nUnlike opinionated open-source stacks that lock you into their tooling or upgrade paths, Kairos is truly composable — you can swap any layer without rebuilding your world. It’s designed for flexibility without compromise, giving you a declarative, production-grade OS image with full control from kernel to kubelet.\n\nThrough live demos and real-world scenarios, we’ll explore how Kairos enables teams to take control of their infrastructure without abandoning existing know-how or processes. Whether you’re deploying to edge devices, bare metal, or cloud instances, you’ll walk away with a new model for curated infrastructure — not just composed systems.\n\nAnd maybe, just maybe, a craving for sushi.",
      "speakerIds": ["mauro-morales"],
      "tags": ["ENG"],
      "level": "Beginners"
    },
    {
      "id": "lunch",
      "title": "🍽️ Lunch Break",
      "type": "break",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot9",
      "description": "Enjoy a delicious lunch and network with fellow attendees.",
      "isFullWidth": true
    },
    {
      "id": "session-6-track1",
      "title": "Securing the Container Wild West",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot10",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Le nuove normative europee come NIS2 e il Cyber Resilience Act alzano l'asticella per la sicurezza della supply chain software. Gli ecosistemi di container, spesso gestiti in modo informale (\"Wild West\"), rappresentano un'area di rischio critico per le organizzazioni. Questo talk illustra come mettere in sicurezza la supply chain dei container attraverso strategie concrete: riduzione della superficie d'attacco, aggiornamento costante delle immagini, scansione continua delle vulnerabilità, verifica delle firme crittografiche e adozione del framework SLSA, per garantire la conformità normativa e la resilienza operativa.",
      "speakerIds": ["luca-barze"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "session-6-track2",
      "title": "Composable Platforms: Modular Platform Engineering with Kratix and Backstage",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot10",
      "trackId": "track2",
      "roomId": "room2",
      "description": "Constructing and managing platforms for diverse teams and workloads presents a significant challenge in today's cloud-native environment. This session introduces the concept of composable platforms, using modular, reusable components as the foundation for platform engineering. This talk will demonstrate how using Kratix, a workload-centric framework, and Backstage an extensible developer portal enables the creation of self-service platforms that balance standardization with adaptability.  \n\nThe session will detail platform design for scalability and governance, streamlining developer workflows through Backstage, and using Kratix Promises for varied workload requirements. Attendees will gain practical insights into building scalable and maintainable platforms through real-world examples, architectural patterns, and a live demonstration of a fully integrated Kratix-Backstage deployment.",
      "speakerIds": ["hossein-salahi", "fabian-brundke"],
      "tags": ["ENG"],
      "level": "Intermediate"
    },
    {
      "id": "session-7-track1",
      "title": "Cluster API and Proxmox: The odd couple for your Kubernetes on-prem",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot11",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Kubernetes on premises, comporta l'affrontare una serie di sfide dal provisioning alla network, dallo storage sino alla gestione quotidiana. Cluster API è un progetto Kubernetes che mira a semplificare la gestione del ciclo di vita dei cluster attraverso API dichiarative. L'accoppiamento con Proxmox, una piattaforma di virtualizzazione open-source, rappresenta un'interessante proposta per chi cerca una solida soluzione on-premises , aperta e in grado di offrire un provisioning flessibile dell'infrastruttura.In questo talk discuteremo i concetti chiave, vantaggi e svantaggi , di Cluster API, la sua architettura e il modo in cui astrae la complessità del provisioning e della gestione dei cluster Kubernetes, dimostreremo come Proxmox possa fungere ottimamente da fornitore di infrastruttura per Cluster API, sfruttando il suo ricco set di funzionalità e soluzioni per l'iperconvergenza.",
      "speakerIds": ["giuseppe-arancio"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "session-7-track2",
      "title": "How to Use Kubernetes to Control a Vast Network of Clusters",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot11",
      "trackId": "track2",
      "roomId": "room2",
      "description": "Kubernetes is the container orchestration standard. It is expanding to distributed environments across datacenter, on-premises, public clouds. Managing multiple clusters for development, testing, and production in this complex landscape necessitates programmatic solutions.\n\nSolutions exist to programmatic create and manage Kubernetes clusters using Kubernetes itself. ClusterAPI is one such popular solution. It provides a declarative approach to creating, managing, and upgrading Kubernetes clusters from a central management cluster.\n\nOnce a cluster is established, add-ons need to be deployed. In some cases, simply listing all required add-ons suffices. However, add-ons often have dependencies and require specific deployment orders. Additionally, external resources may need to be created and then utilised by applications within the cluster.\n\nSolutions exist for programmatically defining which add-ons should be deployed where. Event frameworks handle dependencies programmatically.\n\nFor short-lived clusters, consistency and velocity are key, while long-lived clusters demand reduced administrative coordination. Consider a scenario where add-ons initially deployed to clusters running Kubernetes v1.30.x need to be updated to a new set upon upgrade to v1.31.x. Application administrators should only need to specify required add-ons for clusters in a particular state. Platform administrators can upgrade cluster and add-on updates automatically happens",
      "speakerIds": ["gianluca-mardente"],
      "tags": ["ENG"],
      "level": "Intermediate"
    },
    {
      "id": "coffee-break-2",
      "title": "☕ Coffee Break",
      "type": "break",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot12",
      "description": "Refresh with coffee and snacks while networking with other attendees.",
      "isFullWidth": true
    },
    {
      "id": "session-8-track1",
      "title": "Governance e Sicurezza su Kubernetes con le Policies as Code",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot13",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Il rilascio di nuovi applicativi su Kubernetes è oramai diventato un'operazione standard attraverso l'utilizzo di sistemi di CI/CD. Essi però non riescono a garantire  che vengano seguite tutte le best practice e le policies di deployment di applicativi, sia quelle generiche che di sicurezza. \n\nUna delle difficoltà principali per i platform engineers infatti è proprio quella di diffondere e garantire l'utilizzo di best practices e policies da parte di tutti i team di sviluppo. Potrebbe sembrare un'attività semplice, ma purtroppo non è sempre cosi, soprattutto in realtà aziendali di medio/grosse dimensioni. Nella realtà richiede tempo e sforzi, creando anche dei potenziali problemi di sicurezza.\n\nLa soluzione a questi problemi è rappresentata da tool come Kyverno, un policy engine nativo Kubernetes. In questo talk andremo ad esplorarne le potenzialità, in modo da garantire l'applicazione delle best practices e delle policy aziendali per applicativi Cloud Native.",
      "speakerIds": ["paolo-carta"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "session-8-track2",
      "title": "The Past, Present, and Future of Postgres in Kubernetes",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot13",
      "trackId": "track2",
      "roomId": "room2",
      "description": "PostgreSQL is steadily becoming the database of choice for cloud-native environments, mirroring its success on VMs and bare metal. This transformation is driven by PostgreSQL’s unmatched extensibility, which powers modern workloads like AI/ML through extensions such as pgvector.\n\nAt the heart of this momentum in Kubernetes is CloudNativePG (CNPG)—a vendor-neutral, open-source PostgreSQL operator now part of the CNCF Sandbox. CNPG has matured rapidly thanks to a growing contributor community and its focus on robust Day 2 operations, making it a reliable alternative to proprietary DBaaS offerings.\n\nRunning Postgres in Kubernetes is no longer an experiment—it's a production-ready path to database cloud neutrality, offering organisations greater control, cost efficiency, and data sovereignty.\n\nIn this talk, I’ll share the journey of PostgreSQL in Kubernetes from its early days to where we are today, and what lies ahead. As a CNPG co-founder and PostgreSQL contributor, I’ll walk you through CNPG’s origins, reasons, architecture, key capabilities, community growth, and future roadmap—giving you practical insights into managing Postgres at scale in the cloud-native world.",
      "speakerIds": ["gabriele-bartolini"],
      "tags": ["ENG"],
      "level": "Intermediate"
    },
    {
      "id": "session-9-track1",
      "title": "Accelerate Cloud-Native Development with Orchestrated AI",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-sponsored-slot2",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Witness the development of a cloud-native application powered by orchestrated AI agents. From idea generation to rapid prototyping, engineering, and scaling, see how coordinated AI can transform days of work into just hours. Discover new ways to supercharge your development workflows for your entire IT factory.",
      "speakerIds": ["davide-calabro"],
      "tags": ["SPONSORED"],
      "level": "Intermediate"
    },
    {
      "id": "session-9-track2",
      "title": "Sponsored Session TBA",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-sponsored-slot2",
      "trackId": "track2",
      "roomId": "room2",
      "description": "Details for this session will be announced soon. Stay tuned for updates!",
      "speakerIds": ["speaker-sponsor-1"],
      "tags": [],
      "level": "all"
    },
    {
      "id": "session-10-track1",
      "title": "A GitOps Journey: Continuous Deployment with FluxCD & Flagger",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot15",
      "trackId": "track1",
      "roomId": "room1",
      "description": "In this session we will learn how to use FluxCD and Flagger to implement advanced deployment strategies in Kubernetes. As a bonus, we will look into some highlights from Kubecon 2025, the Flux Operator, and a quick overview of the Headlamp Flux Plugin, the latest FluxCD UI.\n\nYou will leave this talk knowing more about GitOps, FluxCD, Flagger, and what you need to successfully implement different Deployment Strategies in Kubernetes using these tools (Blue/Green, Canary, A/B testing).",
      "speakerIds": ["riccardo-capraro"],
      "tags": ["ITA"],
      "level": "Intermediate"
    },
    {
      "id": "session-10-track2",
      "title": "Surviving the K8spocalypse: The Untold Saga of Multi-Site Disaster Recovery",
      "type": "talk",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot15",
      "trackId": "track2",
      "roomId": "room2",
      "description": "What really happens when a Kubernetes region goes dark? The promise of resilience often stops at \"multi-zone\", but true disaster recovery across sites requires solving problems most platform teams don't discover until it's too late.\n\nThis talk reveals the hidden challenges of multi-region Kubernetes that aren't covered in documentation or most architecture discussions. Through live failover demonstrations on , you'll witness critical failure points across load-balancing configurations, health check propagation, storage replication for stateful workloads, and network routing that can make or break your recovery.\n\nMiss this talk, and you might be stuck rebuilding your DR strategy from scratch after your first major outage, or worse, explaining to leadership why recovery took 10x longer than your SLAs promised.",
      "speakerIds": ["nic-vermande"],
      "tags": ["ENG"],
      "level": "Advanced"
    },
    {
      "id": "closing-remarks-1",
      "title": "Why & how is the EU investing 3 Billion Euro in open source technologies for the cloud",
      "type": "keynote",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot16",
      "trackId": "track1",
      "roomId": "room1",
      "description": "In early 2024, the European Union launched the largest open source project in the history of the continent: the Important Project of Common European Interest on Cloud Infrastructure and Services (IPCEI-CIS). As part of this initiative, supported by 12 EU Member States (including Italy), more than 120 European companies are working together to build a stack of open source technologies for managing and deploying applications across the cloud-edge continuum. So far, this is the main collective effort in Europe to regain its technological sovereignty in a market largely controlled by Big Tech corporations where \"proximity cloud\" providers play quite a marginal role. The IPCEI-CIS is also expected to support the emergence of new open source projects and to help them stay and flourish in Europe as part of a larger ecosystem based on mutual cooperation and interoperability.",
      "speakerIds": ["alberto-p-marti"],
      "isFullWidth": true
    },
    {
      "id": "closing-remarks-2",
      "title": "🗣️ Closing Remarks",
      "type": "keynote",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot17",
      "trackId": "track1",
      "roomId": "room1",
      "description": "Join us for the closing remarks summarizing the key takeaways from Cloud Native Days Italy 2025.",
      "speakerIds": ["speaker-1"],
      "isFullWidth": true
    },
    {
      "id": "aperitivo-networking",
      "title": "🥂 Aperitivo & Networking",
      "type": "break",
      "dayId": "conference-day",
      "timeSlotId": "conf-slot18",
      "description": "Join us for aperitivo and networking. A perfect opportunity to connect with speakers and fellow attendees.",
      "isFullWidth": true
    }
  ]
}

