{
  "speakers": [
    {
      "id": "monica-colangelo",
      "name": "Monica Colangelo",
      "role": "AWS Hero & Head of Hyperscaler Operations",
      "company": "ReeVo",
      "companyUrl": "#",
      "image": "/images/mc/monica.jpg",
      "linkedin": "https://www.linkedin.com/in/monicacolangelo/",
      "bio": "Monica is a cloud leader and active voice in the global tech community. As an AWS Hero, she brings deep expertise and a drive to empower others, adding inspiration and a cloud-native perspective to every moment of the event."
    },
    {
      "id": "maurizio-argoneto",
      "name": "Maurizio Argoneto",
      "role": "CTO",
      "company": "Publisys",
      "companyUrl": "https://www.publisys.it/",
      "image": "/images/mc/maurizio.png",
      "linkedin": "https://www.linkedin.com/in/argomauro/",
      "bio": "Maurizio brings a long track record as a speaker and tech advocate. Deeply rooted in developer communities and passionate about sharing knowledge, he’s ready to connect people and ideas on stage with energy and enthusiasm."
    },
    {
      "id": "speaker-1",
      "name": "Speaker TBA",
      "role": "",
      "company": "",
      "companyUrl": "#",
      "image": "/images/favicon.png",
      "linkedin": "#",
      "bio": "Speaker details will be announced soon."
    },
    {
      "id": "speaker-sponsor-1",
      "name": "Speaker TBA",
      "role": "",
      "company": "",
      "companyUrl": "#",
      "image": "/images/favicon.png",
      "linkedin": "#",
      "bio": "Speaker details will be announced soon."
    },
    {
      "id": "matteo-bianchi",
      "name": "Matteo Bianchi",
      "role": "Solutions Engineer @ GitHub | CNCF Ambassador | Kubernetes Release Team",
      "company": "GitHub",
      "companyUrl": "https://github.com",
      "image": "https://sessionize.com/image/3504-400o400o1-QoGY5M2b9EMrpKTDVZ81c8.jpg",
      "linkedin": "https://www.linkedin.com/in/mbianchidev/",
      "bio": "Matteo is a Solutions Engineer at GitHub, CNCF Ambassador and Cloud Native aficionado, a former startup CTO and DevRel. Kubernetes open source contributor, part of the release team since v.1.31, Comms Release Lead for v.1.32 and serving as Release Lead Shadow for v1.33.  Hacker, builder and problem solver by nature. Singing in a metal band whenever there's nothing to fix in the cloud. @mbianchidev on (almost) every social media."
    },
    {
      "id": "claudio-masolo",
      "name": "Claudio Masolo",
      "role": "Senior DevOps engineer @ Nearform | Senior editor @ InfoQ",
      "company": "Nearform",
      "companyUrl": "https://www.nearform.com/",
      "image": "https://sessionize.com/image/0d3e-400o400o1-LJY5izbtZJTa7wHA4r9sDB.jpg",
      "linkedin": "https://www.linkedin.com/in/cmasolo/",
      "bio": "Claudio lavora come Senior DevOps Engineer in Nearform. È appassionato di infrastrutture cloud e si dedica allo sviluppo di strumenti che migliorano la produttività e l’efficienza degli sviluppatori. Il suo focus principale è sulle tecnologie legate all’AI e al Machine Learning."
    },
    {
      "id": "gianluca-mardente",
      "name": "Gianluca Mardente",
      "role": "Cisco Systems, Principal Engineer",
      "company": "Projectsveltos",
      "companyUrl": "https://github.com/projectsveltos",
      "image": "https://sessionize.com/image/2fb7-400o400o1-M2ZReBLTti6xkMfNaigyfn.jpg",
      "linkedin": "https://www.linkedin.com/in/gianlucamardente/",
      "bio": "A passionate advocate for automation in Kubernetes environments, Gianluca brings a lot of experience to his role as a Principal Engineer at Cisco Systems. Previously, he built his Kubernetes skills at Tigera, the company behind the open-source Project Calico. Now, he continues to contribute to the open-source community by actively maintaining Projectsveltos, a set of Kubernetes controllers that simplify add-on and application management across multiple clusters. His dedication extends beyond Projectsveltos with k8s-cleaner, another Kubernetes controller he maintains. This tool streamlines cluster efficiency by automatically identifying and removing unused or unhealthy resources. In his free time, Gianluca enjoys spending time with his family and participating in fantasy soccer, managing two leagues."
    },
    {
      "id": "xavier-avrillier",
      "name": "Xavier Avrillier",
      "role": "Solutions Architect at Giant Swarm",
      "company": "Giant Swarm",
      "companyUrl": "https://giantswarm.io",
      "image": "https://sessionize.com/image/a408-400o400o1-NsfANkkf9XGFFEdVSMHpAz.jpg",
      "linkedin": "https://www.linkedin.com/in/avrillier/",
      "bio": "Xavier is a Solutions Architect at Giant Swarm, he is currently working on the managed Kubernetes product in hybrid environments and smart factories. His main focus is around cluster lifecycle and customer implementations."
    },
    {
      "id": "mauro-morales",
      "name": "Mauro Morales",
      "role": "Open Source Developer Specialist at Spectro Cloud",
      "company": "Spectro Cloud",
      "companyUrl": "https://www.spectrocloud.com",
      "image": "https://sessionize.com/image/c761-400o400o1-BA8KSmsjgTu97q9TnZYrbV.jpg",
      "linkedin": "https://www.linkedin.com/in/mauromorales/",
      "bio": "Hi, I’m Mauro Morales! Born and raised in Guatemala, my tech journey has taken me across the globe—from the scenic Alps of Switzerland to the bustling streets of Berlin, and now to the charming cobblestone lanes of Ghent, Belgium. Since the mid-2000s, I’ve been coding, creating, and sharing my passion for technology. I work as an Open-Source Developer Specialist at Spectro Cloud, where I help shape Kairos, a groundbreaking operating system for edge computing. You’ll often find me at events like FOSDEM, KubeCon, and Open-Source Summit, geeking out about all things tech and connecting with fellow enthusiasts. I also serve as co-chair of the CNCF Special-Purpose Operating Systems Working Group, collaborating with brilliant minds to reimagine what’s possible in the OS space. When I’m not coding or presenting, you’ll most likely find me lacing up my running shoes and hitting the streets of Ghent."
    },
    {
      "id": "paolo-carta",
      "name": "Paolo Carta",
      "role": "Software and DevOps Engineer",
      "company": "Working with Paolo",
      "companyUrl": "https://withpaolo.com",
      "image": "https://sessionize.com/image/fecb-400o400o1-3eig5qXbCHV9oe1wBbWrB6.jpg",
      "linkedin": "https://www.linkedin.com/in/paolo-carta/",
      "bio": "Born and grown in the beautiful Sardinia in Italy, he moved to Zurich to complete his studies at the Swiss Federal Institute of Technology. After working there on delay tolerant networks with Android devices as a research assistant, he focused on backend development on the JVM and scalable, resilient software architectures in the cloud. He is a Certified Kubernetes Application Developer, conference speaker and he is currently working as a Freelance Consultant after the important experience at Red Hat."
    },
    {
      "id": "luca-barze",
      "name": "Luca Barzè",
      "role": "Solution Architect @ SUSE",
      "company": "SUSE",
      "companyUrl": "#",
      "image": "https://sessionize.com/image/6582-400o400o1-VDrzwGFqf9XZi2sBa7Q7H7.jpg",
      "linkedin": "https://www.linkedin.com/in/barze/",
      "bio": "Luca lavora come Presales Engineer presso SUSE, dove mette a disposizione la sua conoscenza dei sistemi IT, dei servizi cloud, e del mondo cloud-native per supportare il processo di vendita. Con un background in fisica e un forte interesse per le innovazioni tecnologiche, apprezza il fatto di aiutare i clienti e la community a orientarsi tra le esigenze tecnologiche. La sua esperienza spazia da ruoli di consulenza sul cloud, all’architettura dei big data e all’innovazione IT."
    },
    {
      "id": "vladi-stevanovic",
      "name": "Vladi Stevanovic",
      "role": "Director of Community at Multiplayer",
      "company": "Multiplayer",
      "companyUrl": "https://multiplayer.app/",
      "image": "https://sessionize.com/image/ebf0-400o400o1-hCaCTZqvXarqqovGypd9V7.png",
      "linkedin": "https://www.linkedin.com/in/vladi-stevanovic/",
      "bio": "Director of Community at Multiplayer, with 10+ years of experience in building developer communities and enablement. Previously leading customer success at Prisma and MongoDB. I'm interested in all things system design, distributed systems, and observability. You can usually find me working on my couch surrounded by dogs."
    },
    {
      "id": "nic-vermande",
      "name": "Nic Vermande",
      "role": "Owner @Staticvoid",
      "company": "Staticvoid",
      "companyUrl": "https://metalbear.co",
      "image": "https://sessionize.com/image/605d-400o400o1-QQgbSW9E8VPHaB7QyAcXSw.png",
      "linkedin": "https://www.linkedin.com/in/vnicolas/",
      "bio": "Nic is an experienced hands-on technologist, evangelist and product owner who has been working in the fields of Cloud-Native technologies, Open Source Software, Virtualization and Datacenter networking for the past 18 years. Passionate about enabling users and building cool tech solving real-life problems, you'll often see him speaking at global tech conferences and online events, spreading the word and walking the walk with customers and users."
    },
    {
      "id": "gabriele-bartolini",
      "name": "Gabriele Bartolini",
      "role": "VP, Chief Architect of Kubernetes at EDB",
      "company": "EDB",
      "companyUrl": "https://enterprisedb.com",
      "image": "https://sessionize.com/image/6f88-400o400o1-QBQ1Yjk7admpURw8yZBVUY.jpg",
      "linkedin": "https://www.linkedin.com/in/gbartolini/",
      "bio": "Gabriele, a passionate open-source advocate, has played a pivotal role in shaping PostgreSQL's global growth. His focus on enhancing business continuity for large-scale databases aligns with his advocacy for stateful workloads in cloud-native environments since 2019. As a co-founder and active maintainer of CloudNativePG, along with being a PostgreSQL contributor and a Data on Kubernetes (DoK) Ambassador, he continues to innovate in the PostgreSQL's ecosystem. Currently at EDB."
    },
    {
      "id": "marco-ferraioli",
      "name": "Marco Ferraioli",
      "role": "Platform Architect @ ReeVo",
      "company": "ReeVo S.p.A.",
      "companyUrl": "#",
      "image": "https://sessionize.com/image/21f4-400o400o1-GZFK42rY4yoTZgcKwMHJx7.jpg",
      "linkedin": "https://www.linkedin.com/in/marcoferraioli93",
      "bio": "Marco Ferraioli (online ParanoiaSystem) è un appassionato di tecnologie cloud, specializzato in containerizzazione e Kubernetes. Nel tempo libero sperimenta con IoT, domotica ed elettronica, utilizzando microcontrollori come Arduino e ESP32 per applicazioni di smart home. La stampa 3D è tra i suoi hobby preferiti, considerandola un esempio perfetto di integrazione tra mondo digitale e fisico. Condivide regolarmente le sue esperienze attraverso articoli, corsi e talk per ispirare altri tech enthusiast nel loro percorso di innovazione."
    },
    {
      "id": "massimo-groppelli",
      "name": "Massimo Groppelli",
      "role": "Head of DevOps @ Zucchetti Cloud Business Services Department",
      "company": "Zucchetti SPA",
      "companyUrl": "https://www.zucchetti.it/",
      "image": "https://sessionize.com/image/7e7d-400o400o1-a754S4isZ2HP52sG9F41mi.jpg",
      "linkedin": "https://www.linkedin.com/in/massimo-groppelli-04b564108",
      "bio": "I am an experienced software engineer with over 15 years of experience in the IT industry. I have a consolidated background in Domain Driven Design, Test Driven Development, and Object Oriented Programming disciplines. After 10 years of hands-on experience in Java and JavaScript, I shifted to a DevOps role, fascinated by the cloud-native world. As a DevOps Engineer, I focused on container orchestration, observability, and automation. Today, I lead the DevOps team in the Zucchetti Cloud Department, where I drive Cloud Native migration, shaping the technological landscape of our private cloud."
    },
    {
      "id": "luca-carini",
      "name": "Luca Carini",
      "role": "DevOps Engineer @ Zucchetti",
      "company": "Zucchetti SPA",
      "companyUrl": "https://www.zucchetti.it",
      "image": "https://sessionize.com/image/d22f-400o400o1-BQWkZnFxQVsRTRuQaz8mPC.jpg",
      "linkedin": "https://www.linkedin.com/in/luca-carini-8a178b1b2",
      "bio": "Luca Carini is a seasoned Software Engineer with extensive experience in IT and ICT, backed by a strong foundation in DevOps and Kubernetes. With a solid background in Java development, he spent six years creating backend systems for eCommerce solutions and digital invoicing platforms. Luca currently works as a DevOps Engineer at Zucchetti SPA, where he specializes in cloud-native technologies and actively promotes their adoption."
    },
    {
      "id": "hossein-salahi",
      "name": "Hossein Salahi",
      "role": "Tech Lead",
      "company": "Liquid Reply",
      "companyUrl": "https://www.reply.com/liquid-reply/en/",
      "image": "https://sessionize.com/image/939f-400o400o1-XcBVvUVN8kAZLNqrW7BVFV.jpg",
      "linkedin": "https://de.linkedin.com/in/hossein-salahi",
      "bio": "Hossein is an experienced cloud computing professional with nearly a decade of expertise in distributed systems and cloud technologies. He began as a working student specializing in cloud automation at the Max Planck Institute, progressing to a full-time role focusing on on-premises cloud infrastructure and Docker. He built an on-premises Kubernetes platform in the industry and later honed his cloud and DevOps expertise as a senior consultant. As a tech lead, Hossein drives impactful projects, mentors platform engineers, and contributes to the community through talks and workshops."
    },
    {
      "id": "fabian-brundke",
      "name": "Fabian Brundke",
      "role": "Liquid Reply | Senior Platform Engineer",
      "company": "Liquid Reply GmbH",
      "companyUrl": "https://www.reply.com/liquid-reply/en/",
      "image": "https://sessionize.com/image/a0fd-400o400o1-3efqz4PAuaQE7UYMeW3M6S.jpg",
      "linkedin": "https://www.linkedin.com/in/fabian-brundke",
      "bio": "Fabian is a seasoned Platform Engineer with a physics background. He began his IT career as a full-stack developer, transitioned into a DevOps role, and eventually honed his skills in platform engineering. With his experience, Fabian is dedicated to helping companies create lasting and impactful solutions. By simplifying tasks around the SDLC, he allows developers to focus on what they do best. His enthusiasm for exploring the latest cloud-native tools keeps him at the forefront of the field."
    },
    {
      "id": "riccardo-capraro",
      "name": "Riccardo Capraro",
      "role": "Cloud and Platform Engineering consultant (AWS, K8s) @ SQUER",
      "company": "SQUER",
      "companyUrl": "https://www.squer.io/",
      "image": "https://sessionize.com/image/6c51-400o400o1-huDmuXqwVvWRQGek5Mvdzt.jpg",
      "linkedin": "https://www.linkedin.com/in/capraroriccardo",
      "bio": "A passionate and proactive spirit that will help you achieve your goals in the domains of Cloud Infrastructure, Platform Engineering, CI/CD, and much more... I offer a unique combination of hands-on experience operating high-stakes applications at scale, in different business domains, and a wide breadth of knowledge spanning the whole software lifecycle, from the single line of code up to production operations."
    },
    {
      "id": "giuseppe-arancio",
      "name": "Giuseppe Arancio",
      "role": "Senior Platform Engineer @ Sparkfabrik",
      "company": "SparkFabrik",
      "companyUrl": "https://www.sparkfabrik.com/",
      "image": "https://sessionize.com/image/c7cf-400o400o1-NLgL2NxFNzuKr7v84BwitZ.jpg",
      "linkedin": "https://www.linkedin.com/in/giuseppe-arancio/",
      "bio": "Passionate about computer science from an early age, I still remember the \"love at first sight\" feeling with the Internet as soon as I saw the Yahoo homepage. After graduating in telecommunications engineering, I begin my professional adventure working on a research project on home automation, based on Arduino programming, powerline technology and different protocols. I've been a Test Engineer till 2017 when I fell in love again with Kubernetes and the CNCF!"
    },
    {
      "id": "giulio-puri",
      "name": "Giulio Puri",
      "role": "Sr Solutions Engineer",
      "company": "Sysdig",
      "companyUrl": "https://sysdig.com/",
      "image": "https://sessionize.com/image/d48f-400o400o1-7KUvTXiwWoFNnpDmHFHMQV.jpg",
      "linkedin": "https://www.linkedin.com/in/giuliopuri/",
      "bio": "Giulio Puri è un Solutions Engineer specializzato in sicurezza informatica e cloud security. Attualmente lavora presso Sysdig, società specializzata in cloud-native security che contribuisce attivamente a progetti open source, come Falco e Stratoshark. Giulio è fortemente impegnato nella diffusione delle best practices di sicurezza negli ambienti Kubernetes e cloud-native, supportando le aziende nell'implementazione e nell'ottimizzazione dei controlli di sicurezza del perimetro cloud-native."
    },
    {
      "id": "andrea-vivaldi",
      "name": "Andrea Vivaldi",
      "role": "Sr Customer Solution Architect @Sysdig",
      "company": "Sysdig",
      "companyUrl": "#",
      "image": "https://sessionize.com/image/4a51-400o400o1-7uZuD8HGkFTghKW7V8yL2y.png",
      "linkedin": "https://www.linkedin.com/in/andreavivaldi/",
      "bio": "Professionista in ambito Cloud Native con una solida esperienza nel settore. Attualmente lavoro presso Sysdig, un'azienda specializzata in soluzioni di sicurezza e monitoraggio per container e infrastrutture cloud-native. In precedenza, ho collaborato per diversi System Integrator sempre con ruoli relativi alle architetture Cloud Native e DevOps."
    },
    {
      "id": "jonathan-battiato",
      "name": "Jonathan Battiato",
      "role": "EDB Senior SDE | DoKC Ambassador",
      "company": "EDB",
      "companyUrl": "https://www.enterprisedb.com/",
      "image": "https://sessionize.com/image/a816-400o400o1-RunTDbHmNUc1wrwhxUXA49.png",
      "linkedin": "https://www.linkedin.com/in/jonathanbattiato/",
      "bio": "Jonathan Battiato started as a Linux SysAdmin, and became a PostgreSQL administrator and benchmark specialist. Since 2019 he joined the CloudNative Team, working as a QA and automation engineer for CloudNativePG on K8S environments, having earned the CKA and CKS certifications. In 2024 he became a DoKC Ambassador, and organizer of DoKC Tuscany Meetups. In his private life he prefers spending time on DIY projects, playing music, video games, and watching science fiction movies."
    },
    {
      "id": "jonathan-gonzalez-v",
      "name": "Jonathan Gonzalez V.",
      "role": "Senior Kubernetes Developer",
      "company": "EDB",
      "companyUrl": "#",
      "image": "https://sessionize.com/image/7153-400o400o1-hyfh6VFqF98B7wGxp5wLLe.jpg",
      "linkedin": "https://www.linkedin.com/in/jagonzalezv/",
      "bio": "Maintainer of CloudNativePG and passionate for OpenSource and all the tools that has created to help a lot of people to build their dreams."
    },
    {
      "id": "ettore-di-giacinto",
      "name": "Ettore Di Giacinto",
      "role": "Head of Open source",
      "company": "Spectro Cloud",
      "companyUrl": "https://www.spectrocloud.com/",
      "image": "/images/speakers/ettore-di-giacinto.jpg",
      "linkedin": "https://www.linkedin.com/in/ettore-di-giacinto-211a4166/",
      "bio": "Ettore is a long-time Open Source hacker and hacktivist.\nEttore has been in the Open Source community for more than 16 years.\nHe is now a retired Gentoo developer, Sabayon Linux Lead and contributor to several FOSS projects among openSUSE, Cloud Foundry, openQA, and more\nPreviously he also worked at SUSE where he was leading the Elemental team.\nHe is a Golang and Kubernetes enthusiast with a strong Linux background skillset. Ettore is the LocalAI creator and maintainer.\n\nCan find him as @mudler on Github and @mudler_it on Twitter"
    },
    {
      "id": "dimitris-karakasilis",
      "name": "Dimitris Karakasilis",
      "role": "Open Source Principal Software Engineer",
      "company": "Spectro Cloud",
      "companyUrl": "https://www.spectrocloud.com/",
      "image": "/images/speakers/dimitris-karakasilis.jpg",
      "linkedin": "https://www.linkedin.com/in/jimmykarily/",
      "bio": "With over 20 years of experience as a developer, I'm deeply passionate about open source technologies. I've worked with startups and enterprises alike, using open source solutions to tackle real-world problems. Currently, my focus is on edge computing and Kubernetes. I'm excited to share my knowledge with other people."
    },
    {
      "id": "serena-sensini",
      "name": "Serena Sensini",
      "role": "Innovation & Emerging Technologies Leader @Dedalus | Writer @Apogeo | Blogger @TheRedCode.it | Codemotion Ambassadorr",
      "company": "Dedalus",
      "companyUrl": "https://www.dedalus.com/global/en/",
      "image": "/images/speakers/serena-sensini.jpeg",
      "linkedin": "https://www.linkedin.com/in/serena-sensini",
      "bio": ""
    },
    {
      "id": "flavia-paganelli",
      "name": "Flavia Paganelli",
      "role": "CNCF TAG Env tech lead & CTO",
      "company": "Aknostic",
      "companyUrl": "https://www.aknostic.com/",
      "image": "/images/speakers/flavia-paganelli.png",
      "linkedin": "https://www.linkedin.com/in/flaviapaganelli/",
      "bio": "I'm a software engineer, entrepreneur, and co-founder on a mission to leave the world a little better than I found it. With a couple of decades of experience building software and teams, I’m currently the CTO at Aknostic and a Tech Lead in the CNCF TAG Sustainability’s Green Reviews working group.\n\nIn the early days, I co-authored several O’Reilly books on AWS and built an IoT platform for agricultural growers. Now, my focus is on figuring out how we can leverage technology to make the world more sustainable.\n\nOriginally from Argentina, love brought me to the Netherlands, where I live with my family—two kids, two cats, and my partner in both life and business."
    },
    {
      "id": "luca-spagnoli",
      "name": "Luca Spagnoli",
      "role": "Filed CTO",
      "company": "Aruba",
      "companyUrl": "https://www.aruba.it/",
      "image": "/images/speakers/luca-spagnoli.jpg",
      "linkedin": "https://www.linkedin.com/in/luca-spagnoli-72128919/",
      "bio": "Luca Spagnoli è un appassionato di tecnologia con una profonda conoscenza delle soluzioni Cloud e delle tecnologie infrastrutturali, maturata in oltre 25 anni di esperienza nel settore, durante i quali ha ricoperto diversi ruoli di consulenza. Al momento ricopre il ruolo di Field CTO Aruba. Precedentemente è stato solution architect, consulente, system engineering EMC, Dell, AWS e altre multinazionali. In qualità di direttore tecnico, Luca ha guidato lo sviluppo di piattaforme di gestione del cloud all'avanguardia, ottenendo miglioramenti significativi in termini di agilità e customer experience."
    },
    {
      "id": "amedeo-palopoli",
      "name": "Amedeo Palopoli",
      "role": "Cloud Architect",
      "company": "Aruba",
      "companyUrl": "https://www.aruba.it/",
      "image": "/images/speakers/amedeo-palopoli.png",
      "linkedin": "https://www.linkedin.com/in/amedeo-palopoli-491b2a75/",
      "bio": "Cloud Architect at Aruba Cloud, passionate about technological innovation and expert in containerization and cloud computing.\n\nI embraced Kubernetes in 2016 during my Master’s thesis in Computer Engineering at the University of Bologna. During this time, I deepened my interest in containerization and the deployment of cloud-native applications on Kubernetes through research studies that led to publications in scientific journals such as ACM and IEEE. The cloud-native ecosystem and its related technologies have been an integral part of my professional journey, supported by continuous learning and various certifications, including AWS Solutions Architect and Elasticsearch Certified Engineer."
    },
    {
      "id": "tommaso-dri",
      "name": "Tommaso Dri",
      "role": "Founder & CTO",
      "company": "Archeido",
      "companyUrl": "https://archeido.com/en",
      "image": "/images/speakers/tommaso-dri.jpg",
      "linkedin": "https://www.linkedin.com/in/tommaso-dri/",
      "bio": "CTO e socio fondatore di Archeido Srl, software house altamente specializzata nel cloud computing. Nasce come sviluppatore backend (background tecnico) e con il tempo ha acquisito competenze più trasversali anche manageriali e imprenditoriali. Negli anni si è specializzato sempre più in ambito cloud. Ad oggi il “titolo” che più lo rappresenta affiancato a CTO è quello di Cloud Architect."
    },
    {
      "id": "davide-calabro",
      "name": "Davide Calabrò",
      "role": "Senior Tech Leader",
      "company": "Mia-Platform",
      "companyUrl": "https://mia-platform.eu",
      "image": "/images/speakers/davide-calabro.jpg",
      "linkedin": "https://www.linkedin.com/in/davidecalabro/",
      "bio": "My name is Davide Calabrò, 27 years old, from Italy. After some years as a software engineer, in September 2021 I landed in Mia-Care. I am involved in the development of the Mia-Platform IDP, following the requirements and features needed for the development of Software as a Medical Device (SaMD). In my spare time, I ride my motorbike and go hiking."
    },
    {
      "id": "alberto-p-marti",
      "name": "Alberto P. Marti",
      "role": "VP of Open Source Innovation at OpenNebula Systems & Chair of the Industry Facilitation Group of the IPCEI-CIS",
      "company": "OpenNebula Systems",
      "companyUrl": "https://opennebula.io/",
      "image": "/images/speakers/AlbertoPMarti.jpg",
      "linkedin": "https://www.linkedin.com/in/albertomarti/",
      "bio": "Alberto has spent most of his career in Spain and in the UK, both in Tech and in Higher Education. As VP of Open Source Innovation at OpenNebula Systems, he deals with strategic collaborations with cloud and edge providers, other open source initiatives, and CIOs from relevant vendors. He is one of the initial promoters of the SovereignEdge.EU initiative, coordinating involvement in the Horizon Europe programme and in other joint R&D activities based on European open source technologies for the cloud-edge continuum. In March 2024, Alberto was elected Chair of the Industry Facilitation Group of the new €3B IPCEI Cloud."
    }
  ]
}
